<?php

namespace Database\Seeders;

use App\Http\Controllers\Web\PageController;
use App\Models\Page;
use App\Models\PageTranslation;
use Illuminate\Database\Seeder;

class TermsPageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $page = Page::firstOrCreate([
            'controller' => PageController::class,
            'slug' => 'terms',
            'active' => 1,
        ]);

        $text_uk = <<<EOT
        <ol>
            <li>
            <h4>МЕТА</h4>
            </li>
        </ol>
        <p>ТОВ «УЛФ-ФІНАНС» (далі – Товариство) – власник доменного імені&nbsp;<a href="https://ulfauto.online/">HTTPS://ULFAUTO.ONLINE/</a>, а також авторського права на наповнення цього вебсайта відповідно до законодавства України з авторського права, якщо інше не було чітко визначено в окремих випадках на вебсайті. Авторське право Товариства поширюється на всі матеріали, опубліковані на вебсайті&nbsp;<a href="https://ulfauto.online/">HTTPS://ULFAUTO.ONLINE/</a>&nbsp;(далі – Сайт), а також будь-які матеріали, які можуть бути видалені чи змінені Товариством.</p>
        <p>Дані Правила використання Сайту (далі – Правила) розроблені для відвідувачів/ користувачів Сайту та описують дії, які спрямовані на забезпечення конфіденційності інформації про відвідувачів/користувачів Сайту Товариства&nbsp;<a href="https://ulfauto.online/">HTTPS://ULFAUTO.ONLINE/</a>.</p>
        <ol start="2">
            <li>
            <h4>ВИЗНАЧЕННЯ ТА СФЕРА ЗАСТОСУВАННЯ</h4>
            </li>
        </ol>
        <p>Цей Сайт має виключно інформаційне значення якщо інше не визначено законодавством України. Товариство не несе відповідальності за можливі наслідки використання інформації на сайті. Для відвідування/користування Сайтом Товариства реєстрація не потрібна.</p>
        <p>Користуючись Сайтом Ви погоджуєтесь з цими Правилами користування Сайту. Ці Правила є угодою між Вами та ТОВ «УЛФ-ФІНАНС», предмет якої описаний в цих Правилах. Товариство може вносити зміни до Правил час від часу без попереднього повідомлення відвідувачів/користувачів Сайту.</p>
        <p>Даний Сайт містить перелік фінансових та інших послуг, що надаються Товариством, а також надає відвідувачам/користувачам додаткові можливості при використанні послуг Товариства. Жодна частина змісту даного Сайту не може бути витлумачена як пропозиція відвідувачу/користувачу Сайту зі сторони Товариства купити/отримати, продати/надати або здійснити будь-які послуги, що пропонуються Товариством.</p>
        <ol start="3">
            <li>
            <h4>НАДАННЯ ТА ВИКОРИСТАННЯ ІНФОРМАЦІЇ</h4>
            </li>
        </ol>
        <p>Інформація про послуги Товариства на цьому Сайті надаються на умовах “як є” і “як доступно”. Ви погоджуєтеся, що будь-яка інформація, розміщена на цьому Сайті, підлягає Вашій власній оцінці перед прийняттям базованого на ній рішення. Ви погоджуєтеся також нести повну відповідальність за використання цієї інформації. Товариство володіє інформацією, розміщеною на цьому Сайті, або має право на її використання. Будь-який відвідувач/користувач має право демонструвати, зберігати, переформатовати, роздруковувати та виконувати інші дії з інформацією, що міститься на цьому Сайті. Однак, публікація, передача, розміщення або поширення в будь-який інший формі інформації, внесення змін та правок до інформації, що міститься на цьому Сайті, без попередньої письмової згоди Товариства, забороняється.</p>
        <p>У випадках, коли відвідувачі/користувачі для отримання детальної інформації або зворотного зв’язку заповнюють онлайн-заявки/анкети та/або надсилають еmail повідомлення, вони залишають персональну інформацію для подальшого опрацювання її відповідними підрозділами Товариства. За таких умов Товариство може зв’язуватися з особами, які заповнили та надіслали такі заявки/анкети, для надання відповідей та більш детальної інформації, опрацювання наданих даних, призначення зустрічей, надсилання публікацій або маркетингових матеріалів тощо.</p>
        <p>Для захисту такої інформації використовується технологія кодування, оскільки дані йдуть через Інтернет. Надання персональних даних, зокрема, може знадобитися у перерахованих нижче випадках.</p>
        <h4>3.1. ЗАПОВНЕННЯ ЗАЯВОК НА ПОСЛУГИ ТОВАРИСТВА</h4>
        <p>Даний Сайт надає відвідувачам можливість дізнатися про переваги послуг Товариства та, в разі зацікавленості в отриманні додаткової інформації, заповнити анкети за відповідними послугами, а також залишити свої контактні дані для подальшої комунікації з представниками Товариства. Дані заявки розташовані на сторінках з описом послуг Товариства.</p>
        <ol start="4">
            <li>
            <h4>КОНФІДЕНЦІЙНІСТЬ ПАРОЛЯ</h4>
            </li>
        </ol>
        <p>У разі присвоєння Вам імені користувача і пароля (як клієнтові або зареєстрованому користувачу), Ви несете відповідальність за збереження його конфіденційності та погоджуєтеся нести повну відповідальність за дії, вчинені під присвоєним Вам ім’ям користувача. Ви погоджуєтеся кожен раз після закінчення роботи виходити з системи клієнтського доступу і негайно повідомити Товариство у разі виникнення підозри, що Ваша конфіденційність порушена.</p>
        <ol start="5">
            <li>
            <h4>ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ</h4>
            </li>
        </ol>
        <p>В обмін на право користуватися інформацією або послугами даного сайту Ви погоджуєтеся надати точну інформацію під час реєстрації та невідкладно оновлювати її в разі потреби, для забезпечення точності такої інформації. Товариство не збирає особисті дані відвідувачів/користувачів, що мають ознаки конфіденційного характеру за допомогою Сайту, за винятком випадків, передбачених законодавством (наприклад, при підборі персоналу).</p>
        <ol start="6">
            <li>
            <h4>РОЗКРИТТЯ ІНФОРМАЦІЇ</h4>
            </li>
        </ol>
        <p>Товариство дотримується вимог чинного законодавства України, зокрема Закону України «Про захист персональних даних», Закону України «Фінансові послуги та державне регулювання ринків фінансових послуг», та не розкриває особисту інформацію, окрім випадків, що потребують таких дій згідно з законодавством України.</p>
        <ol start="7">
            <li>
            <h4>ЗБЕРІГАННЯ ДАНИХ</h4>
            </li>
        </ol>
        <p>Товариство зберігає інформацію, отриману від відвідувачів/користувачів Сайту, виключно з метою надання їм відповідних послуг. Контактна інформація, яка вказується в реєстраційній формі, використовується нами (Товариством) з метою взаємодії з нашими зареєстрованими користувачами, як в індивідуальному порядку, так і через розсилку колективних повідомлень. Ви маєте право відмовитися від отримання повідомлень, що розсилаються одночасно різним адресатам, але в той же час даєте згоду відповісти невідкладно на будь-які повідомлення, спрямовані конкретно Вам і стосуються використання Вами цього Сайту.</p>
        <ol start="8">
            <li>
            <h4>ВКАЗІВКИ ПЕРЕХОДУ НА ІНШІ САЙТИ</h4>
            </li>
        </ol>
        <p>Для зручності цей Сайт може містити вказівники переходу на інші сайти. І хоча Товариство докладає зусилля, щоб упевнитися в надійності інших сайтів, ми не несемо ніякої відповідальності за використання вами інших сайтів або за збиток будь-якого роду, заподіяний в результаті їх використання. Ми рекомендуємо відвідувачам/користувачам перед розміщенням своєї особистої інформації (персональних даних) на інших сайтах уважно ознайомитися з їхньою політикою конфіденційності та/або правилами користування сайтом.</p>
        <ol start="9">
            <li>
            <h4>COOKIES, GOOGLE ANALYTICS</h4>
            </li>
        </ol>
        <p>Інтернет Сайт&nbsp;<a href="https://ulfauto.online/">HTTPS://ULFAUTO.ONLINE/</a>&nbsp;або будь-які з його розділів/підрозділів можуть використовувати файли cookies, статистичну програму Google Analytics.</p>
        <h4>9.1. COOKIES</h4>
        <p>Технологія cookies дозволять нашому Сайту зберігати у Вашому браузері пристрої ідентифікації інформації («ідентифікатори»), які будуть використовуватися тільки нашим Сайтом при його відвідуванні Вами. Cookies не використовуються для встановлення особи, що є відвідувачем&nbsp;<a href="https://ulfauto.online/">HTTPS://ULFAUTO.ONLINE/</a>. Якщо Ви не бажаєте отримувати cookies від&nbsp;<a href="https://ulfauto.online/">HTTPS://ULFAUTO.ONLINE/</a>, Ви можете налаштувати Ваш браузер таким чином, щоб він повідомляв Вас про отримання cookie-файлу, а Ви могли вибирати, приймати його чи ні. При цьому, відключивши cookies в настройках Вашого браузера, Ви не зможете скористатися всіма функціями Сайту.</p>
        <h4>9.2. GOOGLE ANALYTICS</h4>
        <p>Google Analytics надають інструменти цифрової аналітики для своїх користувачів, яка допомагає відслідковувати ефективність маркетингових кампаній, рівень доступності та інформативності контенту, що є предметом найчастішого пошуку на сайті та інше. Товариство використовує цю технологію винятково з метою складання узагальнених статистичних даних про відвідувачів нашого Сайту, а також для оцінки ефективності наших рекламних компаній/розсилок. Отримані відомості допомагають Товариству удосконалювати вебсайт з урахуванням потреб відвідувачів/користувачів Сайту. Статистична програма Google Analytics не збирає та не зберігає персональні дані відвідувачів/користувачів Сайту, а також не використовує та не ділиться даними нашої аналітики.</p>
        <ol start="10">
            <li>
            <h4>ПРИКІНЦЕВІ ПОЛОЖЕННЯ</h4>
            </li>
        </ol>
        <p>Товариство не несе відповідальності за повноту та достовірність інформації, що надають про себе відвідувачі/користувачі Сайту в рамках даних Правил. У випадку виникнення у користувачів Сайту конкретних питань, пов’язаних із діяльністю Товариства, просимо звертатись до Товариства будь-яким зручним для них способом. Усі реквізити, за якими користувачі Сайту зможуть зв’язатись з Товариством, зазначені в розділі Сайту&nbsp;<a href="https://ulfauto.online/">HTTPS://ULFAUTO.ONLINE/</a>.&nbsp;</p>
        <p>У разі отримання Вами доступу до будь-якої частини Сайту Товариства та/або використання інформації з Сайту Товариства, вважається що Ви ознайомилися та погодилися з даними Правилами використання Сайту ТОВ «УЛФ-ФІНАНС».</p>
        EOT;


        $text_ru = <<<EOT
        <ol>
            <li>ЦЕЛЬ</li>
        </ol>
        <p>ООО «УЛФ-ФИНАНС» (далее – Общество) – владелец доменного имени&nbsp;<a href="https://ulfauto.online/">HTTPS://ULFAUTO.ONLINE/</a>&nbsp; а также авторского права на наполнение этого вебсайта в соответствии с законодательством Украины по авторскому праву, если иное не было четко определено в отдельных случаях на вебсайт. Авторское право Общества распространяется на все материалы, опубликованные на сайте&nbsp;<a href="https://ulfauto.online/">HTTPS://ULFAUTO.ONLINE/</a>&nbsp;(далее — Сайт), а также любые материалы, которые могут быть удалены или изменены Обществом.</p>
        <p>Данные Правила использования Сайта (далее — Правила) разработаны для посетителей/пользователей Сайта и описывают действия, направленные на обеспечение конфиденциальности информации о посетителях/пользователях Сайта Общества&nbsp;<a href="https://ulfauto.online/">HTTPS://ULFAUTO.ONLINE/</a>.</p>
        <ol start="2">
            <li>ОПРЕДЕЛЕНИЕ И СФЕРА ПРИМЕНЕНИЯ</li>
        </ol>
        <p>Этот Сайт имеет исключительно информационное значение, если иное не определено законодательством Украины. Общество не несет ответственности за возможные последствия использования информации на сайте. Для посещения/пользования Сайтом Общества регистрация не требуется.</p>
        <p>Пользуясь Сайтом Вы согласны с этими Правилами пользования Сайтом. Настоящие Правила являются соглашением между Вами и ООО «УЛФ-ФИНАНС», предмет которого описан в настоящих Правилах. Общество может вносить изменения в Правила время от времени без предварительного уведомления посетителей/пользователей Сайта.</p>
        <p>Сайт содержит перечень финансовых и других услуг, предоставляемых Обществом, а также предоставляет посетителям/пользователям дополнительные возможности при использовании услуг Общества. Ни одна часть содержания данного Сайта не может быть истолкована как предложение посетителю/пользователю Сайта со стороны Общества купить/получить, продать/оказать или осуществить любые услуги, предлагаемые Обществом.</p>
        <ol start="3">
            <li>ПРЕДОСТАВЛЕНИЕ И ИСПОЛЬЗОВАНИЕ ИНФОРМАЦИИ</li>
        </ol>
        <p>Информация об услугах Общества на этом Сайте предоставляются на условиях «как есть» и «как доступно». Вы соглашаетесь, что любая информация, размещенная на этом Сайте, подлежит Вашей собственной оценке перед принятием основанного на ней решения. Вы также соглашаетесь нести полную ответственность за использование этой информации. Общество владеет информацией, размещенной на данном Сайте, или имеет право на ее использование. Любой посетитель/пользователь имеет право демонстрировать, хранить, переформатировать, распечатывать и выполнять другие действия с информацией, содержащейся на данном Сайте. Однако публикация, передача, размещение или распространение в любой другой форме информации, внесение изменений и правок к информации, содержащейся на этом Сайте, без предварительного письменного согласия Общества запрещается.</p>
        <p>В случаях, когда посетители/пользователи для получения подробной информации или обратной связи заполняют онлайн-заявки/анкеты и/или отправляют e-mail сообщения, они оставляют персональную информацию для дальнейшей обработки ее соответствующими подразделениями Общества. При таких условиях Общество может связываться с лицами, которые заполнили и отправили такие заявки/анкеты, для предоставления ответов и более подробной информации, обработки данных, назначения встреч, отправки публикаций или маркетинговых материалов и т.д.</p>
        <p>Для защиты такой информации используется технология кодирования, поскольку данные идут через Интернет. Предоставление персональных данных, в частности, может потребоваться в следующих случаях.</p>
        <p>3.1. ЗАПОЛНЕНИЕ ЗАЯВОК НА УСЛУГИ ОБЩЕСТВА</p>
        <p>Данный Сайт предоставляет посетителям возможность узнать преимущества услуг Общества и, в случае заинтересованности в получении дополнительной информации, заполнить анкеты по соответствующим услугам, а также оставить свои контактные данные для дальнейшей коммуникации с представителями Общества. Данные заявки находятся на страницах с описанием услуг Общества.</p>
        <ol start="4">
            <li>КОНФИДЕНЦИАЛЬНОСТЬ ПАРОЛЯ</li>
        </ol>
        <p>В случае присвоения Вам имени пользователя и пароля (как клиенту или зарегистрированному пользователю), Вы несете ответственность за сохранение его конфиденциальности и соглашаетесь нести полную ответственность за действия, совершенные под именем пользователя. Вы соглашаетесь каждый раз после окончания работы выходить из системы клиентского доступа и немедленно сообщить Обществу в случае возникновения подозрения, что Ваша конфиденциальность нарушена.</p>
        <ol start="5">
            <li>ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</li>
        </ol>
        <p>В обмен на право пользоваться информацией или услугами данного сайта Вы соглашаетесь предоставить точную информацию во время регистрации и безотлагательно обновлять ее в случае необходимости для обеспечения точности такой информации. Общество не собирает личные данные посетителей/пользователей, имеющих признаки конфиденциального характера посредством Сайта, за исключением случаев, предусмотренных законодательством (например, при подборе персонала).</p>
        <ol start="6">
            <li>РАСКРЫТИЕ ИНФОРМАЦИИ</li>
        </ol>
        <p>Общество соблюдает требования действующего законодательства Украины, в частности Закон Украины «О защите персональных данных», Закон Украины «Финансовые услуги и государственное регулирование рынков финансовых услуг», и не раскрывает личную информацию, кроме случаев, требующих таких действий согласно законодательству Украины.</p>
        <ol start="7">
            <li>ХРАНЕНИЕ ДАННЫХ</li>
        </ol>
        <p>Общество хранит информацию, полученную от посетителей/пользователей Сайта исключительно с целью предоставления им соответствующих услуг. Контактная информация, которая указывается в регистрационной форме, используется нами (Обществом) для взаимодействия с нашими зарегистрированными пользователями, как в индивидуальном порядке, так и через рассылку коллективных сообщений. Вы имеете право отказаться от получения сообщений, рассылаемых одновременно разным адресатам, но в то же время даете согласие ответить безотлагательно на любые сообщения, направленные конкретно Вам и касающиеся использования Вами этого Сайта.</p>
        <ol start="8">
            <li>УКАЗАНИЯ ПЕРЕХОДА НА ДРУГИЕ САЙТЫ</li>
        </ol>
        <p>Для удобства этот сайт может содержать указатели перехода на другие сайты. И хотя Общество прилагает усилия, чтобы убедиться в надежности других сайтов, мы не несем никакой ответственности за использование вами других сайтов или за ущерб любому роду, причиненный в результате их использования. Мы рекомендуем посетителям/пользователям перед размещением личной информации (персональных данных) на других сайтах внимательно ознакомиться с их политикой конфиденциальности и/или правилами пользования сайтом.</p>
        <ol start="9">
            <li>COOKIES, GOOGLE ANALYTICS</li>
        </ol>
        <p>Интернет Сайт&nbsp;<a href="https://ulfauto.online/">HTTPS://ULFAUTO.ONLINE/</a>&nbsp;или любой из его разделов/подразделений может использовать файлы cookies, статистическую программу Google Analytics.</p>
        <p>9.1. COOKIES</p>
        <p>Технология cookies позволит нашему Сайту хранить в Вашем браузере устройства идентификации информации («идентификаторы»), которые будут использоваться только нашим Сайтом при его посещении Вами. Cookies не используются для установки лица, являющегося посетителем https://ulfauto.online/. Если вы не хотите получать cookies от https://ulfauto.online/, вы можете настроить ваш браузер таким образом, чтобы он уведомлял вас о получении cookie-файла, а вы могли выбирать, принимать его или нет. При этом, отключив cookies в настройках вашего браузера, вы не сможете воспользоваться всеми функциями сайта.</p>
        <p>9.2. GOOGLE ANALYTICS</p>
        <p>Google Analytics предоставляет инструменты цифровой аналитики для своих пользователей, которые помогают отслеживать эффективность маркетинговых кампаний, уровень доступности и информативности контента, что является предметом наиболее частого поиска на сайте и прочее. Общество использует эту технологию исключительно для составления обобщенных статистических данных о посетителях нашего Сайта, а также для оценки эффективности наших рекламных компаний/рассылок. Полученные сведения помогают Обществу усовершенствовать вебсайт с учетом потребностей посетителей/пользователей Сайта. Статистическая программа Google Analytics не собирает и не хранит персональные данные посетителей/пользователей сайта, а также не использует и не делится данными нашей аналитики.</p>
        <ol start="10">
            <li>ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</li>
        </ol>
        <p>Общество не несет ответственности за полноту и достоверность информации, предоставляемой посетителями/пользователями Сайта в рамках настоящих Правил. В случае возникновения у пользователей Сайта конкретных вопросов, связанных с деятельностью Общества, просим обращаться в Общество любым удобным для них способом. Все реквизиты, по которым пользователи Сайта смогут связаться с Обществом, указаны в разделе Сайта https://ulfauto.online/.</p>
        <p>В случае получения Вами доступа к любой части Сайта Общества и/или использования информации из Сайта Общества считается, что Вы ознакомились и согласились с данными Правилами использования Сайта ООО «УЛФ-ФИНАНС».</p>
        EOT;


        PageTranslation::firstOrCreate([
            'page_id' => $page->id,
            'name' => 'Правила використання',
            'h1' => 'Правила використання',
            'text' => $text_uk,
            'locale' => 'uk',
        ]);

        PageTranslation::firstOrCreate([
            'page_id' => $page->id,
            'name' => 'Правила использования',
            'h1' => 'Правила использования',
            'text' => $text_ru,
            'locale' => 'ru',
        ]);
    }
}
