<?php

namespace Modules\Articles\Database\Seeders;

use Illuminate\Database\Seeder;
use Modules\Articles\Services\Admin\ArticlesService;
use Illuminate\Http\UploadedFile;

class SeedMakeArticlesPostsSeeder extends Seeder
{
    private ArticlesService $service;

    public function __construct(ArticlesService $service)
    {
        $this->service = $service;
    }
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [
            "slug" => "post-one",
            'name' => [
                'ru' => 'В Украине появилась первая настоящая подписка на автомобиле – ULFAUTO [подписка]',
                'uk' => 'В Україні з’явилася перша справжня підписка на автомобілі – ULFAUTO [підписка]',
            ],
            'description' => [
                'ru' => 'Описание RU',
                'uk' => 'Описание UK',
            ],
            'text' => [
                'ru' => '<p>Спочатку відмова від володіння квартирою або машиною сприймалася як недалекоглядна забаганка розбещених «айтішників». Та з часом все більше людей почали відмовлятися від «обростання» речами. Світ став відкритішим, робота – мобільнішою, життя – наповненішим.</p><p>Ні, це не значить, що люди припинили користуватися досягненнями прогресу. Навпаки, беруть найкраще, але тимчасово, відповідно до потреб – починаючи з оренди житла і каршерінгу, і закінчуючи прокатом побутової техніки та інструментів.</p>',
                'uk' => '<p>Сначала отказ от владения квартирой или машиной воспринимался как недальновидное пристрастие избалованных "айтишников". Но со временем все больше людей начали отказываться от "набивания" вещами. Мир стал более открытым, работа - более мобильной, жизнь - более насыщенной.</p><p>Нет, это не значит, что люди перестали пользоваться достижениями прогресса. Напротив, они выбирают лучшее, но временно, в соответствии с потребностями - начиная с аренды жилья и каршеринга, и заканчивая арендой бытовой техники и инструментов.</p>',
            ],
            'meta_title' => [
                'ru' => null,
                'uk' => null,
            ],
            'meta_description' => [
                'ru' => null,
                'uk' => null,
            ],

            'preview_image' => new UploadedFile(public_path('seederData/articles/1.jpg'), '1.jpg'),
        ];
        $this->service->createDocument($data);


        $data = [
            "slug" => "post-two",
            'name' => [
                'ru' => 'Забудьте о техосмотре, замене шин и масла. Почему подписка на авто удобнее покупки',
                'uk' => 'Забудьте про техогляд, заміну шин і мастила. Чому підписка на авто зручніша за покупку',
            ],
            'description' => [
                'ru' => 'Описание RU',
                'uk' => 'Описание UK',
            ],
            'text' => [
                'ru' => '<p>Спочатку відмова від володіння квартирою або машиною сприймалася як недалекоглядна забаганка розбещених «айтішників». Та з часом все більше людей почали відмовлятися від «обростання» речами. Світ став відкритішим, робота – мобільнішою, життя – наповненішим.</p><p>Ні, це не значить, що люди припинили користуватися досягненнями прогресу. Навпаки, беруть найкраще, але тимчасово, відповідно до потреб – починаючи з оренди житла і каршерінгу, і закінчуючи прокатом побутової техніки та інструментів.</p>',
                'uk' => '<p>Сначала отказ от владения квартирой или машиной воспринимался как недальновидное пристрастие избалованных "айтишников". Но со временем все больше людей начали отказываться от "набивания" вещами. Мир стал более открытым, работа - более мобильной, жизнь - более насыщенной.</p><p>Нет, это не значит, что люди перестали пользоваться достижениями прогресса. Напротив, они выбирают лучшее, но временно, в соответствии с потребностями - начиная с аренды жилья и каршеринга, и заканчивая арендой бытовой техники и инструментов.</p>',
            ],
            'meta_title' => [
                'ru' => null,
                'uk' => null,
            ],
            'meta_description' => [
                'ru' => null,
                'uk' => null,
            ],

            'preview_image' => new UploadedFile(public_path('seederData/articles/2.jpg'), '2.jpg'),
        ];
        $this->service->createDocument($data);

        $data = [
            "slug" => "post-three",
            'name' => [
                'ru' => 'В поисках удобства: почему средний класс переходит на ULFAUTO [подписка]',
                'uk' => 'У пошуках зручності: чому середній клас переходить на ULFAUTO [підписка]',
            ],
            'description' => [
                'ru' => 'Описание RU',
                'uk' => 'Описание UK',
            ],
            'text' => [
                'ru' => '<p>Спочатку відмова від володіння квартирою або машиною сприймалася як недалекоглядна забаганка розбещених «айтішників». Та з часом все більше людей почали відмовлятися від «обростання» речами. Світ став відкритішим, робота – мобільнішою, життя – наповненішим.</p><p>Ні, це не значить, що люди припинили користуватися досягненнями прогресу. Навпаки, беруть найкраще, але тимчасово, відповідно до потреб – починаючи з оренди житла і каршерінгу, і закінчуючи прокатом побутової техніки та інструментів.</p>',
                'uk' => '<p>Сначала отказ от владения квартирой или машиной воспринимался как недальновидное пристрастие избалованных "айтишников". Но со временем все больше людей начали отказываться от "набивания" вещами. Мир стал более открытым, работа - более мобильной, жизнь - более насыщенной.</p><p>Нет, это не значит, что люди перестали пользоваться достижениями прогресса. Напротив, они выбирают лучшее, но временно, в соответствии с потребностями - начиная с аренды жилья и каршеринга, и заканчивая арендой бытовой техники и инструментов.</p>',
            ],
            'meta_title' => [
                'ru' => null,
                'uk' => null,
            ],
            'meta_description' => [
                'ru' => null,
                'uk' => null,
            ],

            'preview_image' => new UploadedFile(public_path('seederData/articles/3.jpg'), '3.jpg'),
        ];
        $this->service->createDocument($data);

        $data = [
            "slug" => "post-four",
            'name' => [
                'ru' => 'Tesla Model 3 Performance за 500 грн на ЗСУ',
                'uk' => 'Tesla Model 3 Performance за 500 грн на ВСУ',
            ],
            'description' => [
                'ru' => 'Описание RU',
                'uk' => 'Описание UK',
            ],
            'text' => [
                'ru' => '<p>Спочатку відмова від володіння квартирою або машиною сприймалася як недалекоглядна забаганка розбещених «айтішників». Та з часом все більше людей почали відмовлятися від «обростання» речами. Світ став відкритішим, робота – мобільнішою, життя – наповненішим.</p><p>Ні, це не значить, що люди припинили користуватися досягненнями прогресу. Навпаки, беруть найкраще, але тимчасово, відповідно до потреб – починаючи з оренди житла і каршерінгу, і закінчуючи прокатом побутової техніки та інструментів.</p>',
                'uk' => '<p>Сначала отказ от владения квартирой или машиной воспринимался как недальновидное пристрастие избалованных "айтишников". Но со временем все больше людей начали отказываться от "набивания" вещами. Мир стал более открытым, работа - более мобильной, жизнь - более насыщенной.</p><p>Нет, это не значит, что люди перестали пользоваться достижениями прогресса. Напротив, они выбирают лучшее, но временно, в соответствии с потребностями - начиная с аренды жилья и каршеринга, и заканчивая арендой бытовой техники и инструментов.</p>',
            ],
            'meta_title' => [
                'ru' => null,
                'uk' => null,
            ],
            'meta_description' => [
                'ru' => null,
                'uk' => null,
            ],

            'preview_image' => new UploadedFile(public_path('seederData/articles/4.png'), '4.png'),
        ];
        $this->service->createDocument($data);

        $data = [
            "slug" => "post-five",
            'name' => [
                'ru' => 'Alfa Romeo Stelvio за 500 грн!',
                'uk' => 'Alfa Romeo Stelvio за 500 грн!',
            ],
            'description' => [
                'ru' => 'Описание RU',
                'uk' => 'Описание UK',
            ],
            'text' => [
                'ru' => '<p>Спочатку відмова від володіння квартирою або машиною сприймалася як недалекоглядна забаганка розбещених «айтішників». Та з часом все більше людей почали відмовлятися від «обростання» речами. Світ став відкритішим, робота – мобільнішою, життя – наповненішим.</p><p>Ні, це не значить, що люди припинили користуватися досягненнями прогресу. Навпаки, беруть найкраще, але тимчасово, відповідно до потреб – починаючи з оренди житла і каршерінгу, і закінчуючи прокатом побутової техніки та інструментів.</p>',
                'uk' => '<p>Сначала отказ от владения квартирой или машиной воспринимался как недальновидное пристрастие избалованных "айтишников". Но со временем все больше людей начали отказываться от "набивания" вещами. Мир стал более открытым, работа - более мобильной, жизнь - более насыщенной.</p><p>Нет, это не значит, что люди перестали пользоваться достижениями прогресса. Напротив, они выбирают лучшее, но временно, в соответствии с потребностями - начиная с аренды жилья и каршеринга, и заканчивая арендой бытовой техники и инструментов.</p>',
            ],
            'meta_title' => [
                'ru' => null,
                'uk' => null,
            ],
            'meta_description' => [
                'ru' => null,
                'uk' => null,
            ],

            'preview_image' => new UploadedFile(public_path('seederData/articles/5.jpg'), '5.jpg'),
        ];
        $this->service->createDocument($data);
    }
}
